package model;

/**
 * Тип бонуса.
 * <p>
 * В дополнение к основному эффекту каждый подобранный бонус даёт игроку {@code game.bonusScoreAmount} баллов, а
 * волшебник получает такое же количество опыта.
 */
public enum BonusType {
    /**
     * На некоторое время значительно увеличивает урон, наносимый волшебником при ударах посохом и попаданиях магических
     * снарядов в цель.
     */
    EMPOWER,

    /**
     * Значительно ускоряет перемещение волшебника.
     * <p>
     * Аналогично действию одноимённого заклинания, но длительность статуса выше.
     */
    HASTE,

    /**
     * Уменьшает урон, получаемый волшебником от прямых попаданий магических снарядов.
     * <p>
     * Аналогично действию одноимённого заклинания, но длительность статуса выше.
     */
    SHIELD
}
