package model;

/**
 * Тип бонуса.
 */
public enum BonusType {
    /**
     * Ремкомплект. Полностью устраняет все повреждения кодемобиля при подборе.
     */
    REPAIR_KIT,

    /**
     * Ящик с метательными снарядами. При подборе пополняет запас снарядов кодемобиля на единицу. Тип снарядов
     * соответствует типу кодемобиля.
     */
    AMMO_CRATE,

    /**
     * Топливо для системы закиси азота. При использовании мгновенно устанавливает мощность двигателя кодемобиля равной
     * значению {@code game.nitroEnginePowerFactor} и не даёт изменять её в течение {@code game.useNitroCooldownTicks}
     * тиков.
     */
    NITRO_BOOST,

    /**
     * Канистра с мазутом. При использовании на {@code game.oilSlickLifetime} тиков создаёт позади кодемобиля скользкую
     * круглую область. Радиус области равен {@code game.oilSlickRadius}, центр находится на продольной оси кодемобиля,
     * а расстояние между ближайшими точками области и кодемобиля составляет {@code game.oilSlickInitialRange}.
     */
    OIL_CANISTER,

    /**
     * Баллы в чистом виде. При подборе данного бонуса игроку мгновенно начисляется {@code game.pureScoreAmount} баллов.
     */
    PURE_SCORE
}
