package model;

/**
 * Тип снаряда.
 */
public enum ProjectileType {
    /**
     * Магическая ракета. Небольшой сгусток чистой энергии, который наносит урон при прямом попадании.
     */
    MAGIC_MISSILE,

    /**
     * Ледяная стрела. Наносит урон при прямом попадании, а также замораживает цель на {@code game.frozenDurationTicks}
     * тиков. Замороженная цель не может перемещаться и совершать какие-либо действия.
     */
    FROST_BOLT,

    /**
     * Огненный шар. Взрывается при достижении максимальной дальности полёта или при столкновении с живым объектом.
     * Наносит урон всем живым объектам, если расстояние от центра шара до центра объекта не превышает
     * {@code game.fireballExplosionMinDamageRange + livingUnit.radius}, а также поджигает их ({@code BURNING}).
     * Мгновенный урон уменьшается по мере удаления от эпицентра взрыва.
     */
    FIREBALL,

    /**
     * Дротик. Заострённый предмет, летящий на большой скорости. Наносит урон при прямом попадании.
     */
    DART
}
