package model;

/**
 * Тип магического статуса, влияющего на живого юнита.
 */
public enum StatusType {
    /**
     * Юнит горит. Каждый тик ему наносится некоторый урон.
     */
    BURNING,

    /**
     * Юнит наносит больше урона, чем обычно. Не применимо к урону, растянутому во времени.
     */
    EMPOWERED,

    /**
     * Юнит заморожен. Он не может перемещаться и выполнять какие-либо действия.
     */
    FROZEN,

    /**
     * Скорость поворота и перемещения юнита увеличена.
     */
    HASTENED,

    /**
     * Юнит получает меньше урона, чем обычно. Не применимо к урону, растянутому во времени.
     */
    SHIELDED
}
